# GetCuttingVoidInstances Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
InstanceVoidCutUtils..::..GetCuttingVoidInstances Method
InstanceVoidCutUtils Class See Also
---
Return ids of the instances with unattached voids cutting the element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public static ICollection<ElementId> GetCuttingVoidInstances(
	Element element
)
```

Visual Basic
---
```text
Public Shared Function GetCuttingVoidInstances ( _
	element As Element _
) As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
static ICollection<ElementId^>^ GetCuttingVoidInstances(
	Element^ element
)
```

# ### Parameters
element
    Type: Autodesk.Revit.DB..::..Element The element being cut
# ### Return Value
Ids of instances with unattached voids that cut this element
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
InstanceVoidCutUtils Class
Autodesk.Revit.DB Namespace